
[
  {
    "name": "Pallavi Rane",
"message": "Dr. Prachi is not only knowledgeable but also approachable. I felt comfortable asking questions and discussing my concerns.\nI had been struggling with back pain for 2 months. After 1st session, I noticed a significant reduction in pain and a marked improvement.\nDr. Prachi is very patient and compassionate. I felt completely at ease during my appointments and would highly recommend Dr. Prachi and this clinic to anyone seeking medication🥰🥰"
  },
  {
    "name": "Pranju Bhagat",
    "message": "Dr.Prachi is an excellent doctor. She is very friendly, helpful, and always willing to assist. Atmosphere of hospital is very good, fresh and positive."
  },
  {
    "name": "YOGESH RANE",
    "message": "The doctor is good and shows genuine concern for the patient. He carefully takes all details about our health issues and focuses on identifying the root cause, while also explaining the medical approach to solve our problems"
  },
  {
    "name": "DEEPALI RAUT",
    "message": "Visiting Dr. Prachi's Homeopathic Clinic was a truly positive experience. From the moment I stepped into the clinic, I felt welcomed and at ease. Dr. Prachi took the time to thoroughly understand my health concerns and provided me with a detailed explanation of how homeopathy could help address my issues. Her personalized approach, patience, and professionalism made me feel confident in her care. Over time, I began noticing improvements in my condition, and I appreciated the consistent follow-up to monitor my progress. I highly recommend Dr. Prachi for anyone looking for a holistic, compassionate, and effective treatment approach."
  },
    {
    "name": "Madhu Bharti",
    "message": "This is very gud clinic ....thanx to prachi mam"
  },
  {
    "name": "Shobha Chauhan",
    "message": "Such a great experience with Dr prachi ma'am healed me holistic way🙏👍 highly recommend.."
  },
    {
    "name": "Noel Fernandes",
    "message": "Amazing Dr with good medical knowledge and expertise, would recommend"
  },
  {
    "name": "Annada Sahoo",
    "message": "Very highly skilled and caring homeopathic doctor who delivers personalized and effective treatment."
  },
    {
    "name": "Mayur Kapasi",
    "message": "Doctor is very good"
  }

]
